## This should be the main notebook where we run all the scripts at once.

You all can work on the loading functions in this notebook using the two dataframes (`new_movies_df` and `new_actors_df`). No need to load from .csv files.

The cell below runs the other two notebooks and imports the functions in the two notebooks.

In [13]:
%run data_extraction.ipynb
%run data_transformation.ipynb

Requirement already satisfied: certifi in c:\users\asus\anaconda3\lib\site-packages (2024.7.4)

In [3]:
!pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\asus\anaconda3\lib\site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\asus\anaconda3\lib\site-packages (from SQLAlchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\asus\anaconda3\lib\site-packages (from SQLAlchemy) (3.0.1)

In [15]:
# to manage json data
import json

# for pandas dataframes
import pandas as pd

import sqlalchemy as db
from sqlalchemy_utils import create_database
from sqlalchemy_utils import database_exists
from sqlalchemy.types import Integer, String, Text, ARRAY, VARCHAR, Date, Numeric, BigInteger

The data stored in the DataFrames (`new_movies_df` and `new_actors_df`) are cleaned and set to the correct data types. Do let me know if they are still not clean and not set to the correct data types. As far as I know, empty values are stored as `0` (integer), `None` (not a string), or `"NaN"` (string). But for the `gender` column in the `new_actors_df` DataFrame, some rows/records will have the `"None"` value stored as a string.

In [18]:
movies_df, actors_df = extract_data()
new_movies_df, new_actors_df = transform_data(movies_df, actors_df)
export_dataframe_to_csv(new_movies_df, '../resources/movies_cleaned.csv')
export_dataframe_to_csv(new_actors_df, '../resources/actors_cleaned.csv')

print(new_movies_df)
print()
print(new_actors_df)

IMDB DATA FILE EXISTS: READING... DONE - 251 MOVIE TITLES IMPORTED

OMDB DATA FILE EXISTS: READING... DONE - 250 MOVIE DATA IMPORTED

TMDB DATA FILE EXISTS: READING... DONE - 250 MOVIE DATA IMPORTED

TMDB DATA FILE EXISTS: READING... DONE - 250 MOVIE DATA IMPORTED

ACTOR ID TEXT FILE EXISTS: READING... DONE - 592 ACTOR IDs IMPORTED

TMDB DATA FILE EXISTS: READING... DONE - 591 ACTOR DATA IMPORTED

      id                     title  year certification release_date  runtime  \
0      1  The Shawshank Redemption  1994             R   1994-10-14      142
1      2             The Godfather  1972             R   1972-03-24      175
2      3           The Dark Knight  2008         PG-13   2008-07-18      152
3      4     The Godfather Part II  1974             R   1974-12-18      202
4      5              12 Angry Men  1957      Approved   1957-04-10       96
..   ...                       ...   ...           ...          ...      ...
245  246                  The Help  2011         PG-13   2011-08-10      146
246  247     It Happened One Night  1934      Approved   1934-02-22      105
247  248                   Aladdin  1992             G   1992-11-25       90
248  249              Paris, Texas  1984             R   1984-08-23      145
249  250        Gangs of Wasseypur  2012     Not Rated   2012-06-22      321

                              genre  \
0                           [Drama]
1                    [Crime, Drama]
2            [Action, Crime, Drama]
3                    [Crime, Drama]
4                    [Crime, Drama]
..                              ...
245                         [Drama]
246               [Comedy, Romance]
247  [Animation, Adventure, Comedy]
248                         [Drama]
249         [Action, Comedy, Crime]

                                           description  \
0    Chronicles the experiences of a formerly succe...
1    The Godfather "Don" Vito Corleone is the head ...
2    Set within a year after the events of Batman B...
3    The continuing saga of the Corleone crime fami...
4    The defense and the prosecution have rested, a...
..                                                 ...
245  Set in Mississippi during the 1960s, Skeeter (...
246  Ellie Andrews has just tied the knot with soci...
247  Aladdin is a poor street urchin who spends his...
248  A man wanders out of the desert after a four y...
249  Shahid Khan is exiled after impersonating the ...

                                         language  \
0                                       [English]
1                       [English, Italian, Latin]
2                             [English, Mandarin]
3    [English, Italian, Spanish, Latin, Sicilian]
4                                       [English]
..                                            ...
245                                     [English]
246                                     [English]
247                                     [English]
248                            [English, Spanish]
249                                       [Hindi]

                                               country  \
0                                      [United States]
1                                      [United States]
2                      [United States, United Kingdom]
3                                      [United States]
4                                      [United States]
..                                                 ...
245                             [United States, India]
246                                    [United States]
247                                    [United States]
248  [West Germany, France, United Kingdom, United ...
249                                    [India, France]

                       directors  oscars  winnings  nominations  \
0               [Frank Darabont]       0        21           42
1         [Francis Ford Coppola]       3        31           31
2            [Christopher Nolan]       2       164          164
3         [Francis Ford Coppola]       6        17           21
4                 [Sidney Lumet]       0        16           12
..                           ...     ...       ...          ...
245                [Tate Taylor]       1        79          121
246                [Frank Capra]       5        11            2
247  [Ron Clements, John Musker]       2        35           22
248                [Wim Wenders]       0        16           12
249             [Anurag Kashyap]       0        18           65

                                                actors  ratings  num_of_votes  \
0            [Tim Robbins, Morgan Freeman, Bob Gunton]      9.3       2918363
1               [Marlon Brando, Al Pacino, James Caan]      9.2       2039832
2        [Christian Bale, Heath Ledger, Michael Caine]      9.0       2907659
3             [Al Pacino, Robert Duvall, Diane Keaton]      9.0       1376501
4           [Martin Balsam, John Fiedler, Lee J. Cobb]      9.0        877276
..                                                 ...      ...           ...
245     [Emma Stone, Viola Davis, Bryce Dallas Howard]      8.1        498075
246  [Clark Gable, Claudette Colbert, Walter Connolly]      8.1        113573
247      [Scott Weinger, Robin Williams, Linda Larkin]      8.0        474008
248  [Harry Dean Stanton, Nastassja Kinski, Dean St...      8.1        121397
249   [Manoj Bajpayee, Richa Chadha, Tigmanshu Dhulia]      8.2        104507

       revenue      budget
0     25000000    28341469
1      6000000   245066411
2    185000000  1004558444
3     13000000   102600000
4       397751     4360000
..         ...         ...
245   25000000   216600000
246     325000     4500000
247   28000000   504050219
248    1750000     2181987
249    1400000     4100000

[250 rows x 19 columns]

      id              name date_of_birth date_of_death  gender  \
0      1       Tim Robbins    1958-10-16           NaN    Male
1      2    Morgan Freeman    1937-06-01           NaN    Male
2      3        Bob Gunton    1945-11-15           NaN    Male
3      4     Marlon Brando    1924-04-03    2004-07-01    Male
4      5         Al Pacino    1940-04-25           NaN    Male
..   ...               ...           ...           ...     ...
586  587  Nastassja Kinski    1961-01-24           NaN  Female
587  588    Dean Stockwell    1936-03-05    2021-11-07    Male
588  589    Manoj Bajpayee    1969-04-23           NaN    Male
589  590      Richa Chadha    1986-12-18           NaN  Female
590  591  Tigmanshu Dhulia    1967-07-03           NaN    Male

     num_of_acting_credits
0                       88
1                      189
2                       88
3                      107
4                      114
..                     ...
586                     78
587                    124
588                     89
589                     29
590                     11

[591 rows x 6 columns]

In [112]:
print(type(new_movies_df.at[209, "certification"]))

<class 'str'>

Getting the list of actors with missing data. Those with "None" as gender are those that have missing date of birth and gender data. I don't know if you all want to remove these actors.

In [9]:
print(new_actors_df[new_actors_df["gender"] == "None"])

                       name date_of_birth date_of_death gender  \
81          Robert Glaudini           NaN           NaN   None
113             George John           NaN           NaN   None
122         Dominique Henry           NaN           NaN   None
138            Florence Lee           NaN           NaN   None
284            Michelle Sun           NaN           NaN   None
285                Zhen Yao           NaN           NaN   None
286           Carlee Soeder           NaN           NaN   None
428  Amir Farrokh Hashemian           NaN           NaN   None
429          Bahare Seddiqi           NaN           NaN   None
430  Nafise Jafar-Mohammadi           NaN           NaN   None
525       Baby Joshika Maya           NaN           NaN   None

     num_of_acting_credits
81                      16
113                      1
122                      1
138                      4
284                      4
285                      1
286                      3
428                      1
429                      1
430                      1
525                      1

Feel free to add cells below and work on the LOADING process into our database.

In [40]:
# user postgres, password admin
# for example, one wants to create a *NEW* db, say, starter
db_name = 'omni_oracle_movies_db'
engine = db.create_engine(f'postgresql://postgres:admin@localhost:5432/{db_name}')
if database_exists(f'postgresql://postgres:admin@localhost:5432/{db_name}'):
    print(f"{db_name} already exists.")
else:
    print(f"Creating database: {db_name}")
    # create database
    create_database(engine.url)

conn = engine.raw_connection()

# release resources associated with engine
engine.dispose()

Creating database: omni_oracle_movies_db

Exception during reset or similar
Traceback (most recent call last):
  File "C:\Users\ASUS\anaconda3\Lib\site-packages\sqlalchemy\pool\base.py", line 986, in _finalize_fairy
    fairy._reset(
  File "C:\Users\ASUS\anaconda3\Lib\site-packages\sqlalchemy\pool\base.py", line 1432, in _reset
    pool._dialect.do_rollback(self)
  File "C:\Users\ASUS\anaconda3\Lib\site-packages\sqlalchemy\engine\default.py", line 698, in do_rollback
    dbapi_connection.rollback()
psycopg2.OperationalError: server closed the connection unexpectedly
	This probably means the server terminated abnormally
	before or while processing the request.

In [42]:
# Initialize connection to PostgreSQL
cur = conn.cursor()

# Create new tables in PostgreSQL
commands = (# TABLE 1: WEATHER
            '''
            CREATE TABLE IF NOT EXISTS movies(id SERIAL PRIMARY KEY,
                                                title TEXT,
                                                year INT,
                                                certification VARCHAR(10),
                                                release_date DATE,
                                                runtime INT,
                                                genre VARCHAR(20)[],
                                                description TEXT,
                                                language VARCHAR(50)[],
                                                country VARCHAR(60)[],
                                                directors TEXT[],
                                                actors TEXT[],
                                                oscars INT,
                                                winnings INT,
                                                nominations INT,
                                                ratings NUMERIC,
                                                num_of_votes BIGINT,
                                                revenue BIGINT,
                                                budget BIGINT);

            CREATE TABLE IF NOT EXISTS actors(id SERIAL PRIMARY KEY,
                                             name TEXT,
                                             date_of_birth DATE,
                                             date_of_death DATE,
                                             gender VARCHAR(6),
                                             num_of_acting_credits INT);

            CREATE TABLE IF NOT EXISTS genres (
                id SERIAL PRIMARY KEY,
                genre_name VARCHAR(20) UNIQUE NOT NULL
            );
                                             
            ''')

# Create cursor to execute SQL commands

#for command in commands:
cur.execute(commands)

# Commit changes
conn.commit()

In [44]:
new_movies_df.to_sql(name= 'movies', con = engine, if_exists= 'replace', index= False,  # Note replace here
          dtype={'id': Integer, 'title':Text, 'year':Integer, 'certification': VARCHAR(10), 'release_date': Date, 'runtime': Integer,
                'genre': ARRAY(VARCHAR(20)), 'description': Text, "language": ARRAY(VARCHAR(50)), "country": ARRAY(VARCHAR(60)), 
                 "directors": ARRAY(Text), "actors": ARRAY(Text), "oscars": Integer, "winnings": Integer, "nominations": Integer,
                "ratings": Numeric, "num_of_votes": BigInteger, "revenue": BigInteger, "budget": BigInteger})

250

In [46]:
new_actors_df.to_sql(name= 'actors', con = engine, if_exists= 'replace', index= False,  # Note replace here
          dtype={'id': Integer, 'name':Text, 'date_of_birth':Date, 'date_of_death': Date, 'gender': VARCHAR(6),
                'num_of_acting_credits': Integer})

591

In [48]:
# Initialize connection to PostgreSQL
cur = conn.cursor()

# Create new tables in PostgreSQL
commands = (# TABLE 1: WEATHER
            '''
            ALTER TABLE movies
            ADD PRIMARY KEY (id);

            ALTER TABLE actors
            ADD PRIMARY KEY (id);

            CREATE TABLE movies_genres (
                movie_id INT REFERENCES movies(id),
                genre_id INT REFERENCES genres(id),
                PRIMARY KEY (movie_id, genre_id)
            );

            INSERT INTO genres (genre_name)
            SELECT DISTINCT UNNEST(genre) AS genre_name
            FROM movies
            ORDER BY genre_name;
            
            INSERT INTO movies_genres (movie_id, genre_id)
            SELECT 
                m.id,
                g.id
            FROM 
                movies m,
                UNNEST(m.genre) AS genre
            JOIN 
                genres g 
            ON g.genre_name = genre;

            CREATE TABLE movies_actors (
                movie_id INT REFERENCES movies(id),
                actor_id INT REFERENCES actors(id),
                PRIMARY KEY (movie_id, actor_id)
            );
            
            INSERT INTO movies_actors (movie_id, actor_id)
            SELECT 
                m.id,
                a.id
            FROM 
                movies m,
                UNNEST(m.actors) AS actor_name
            JOIN 
                actors a 
            ON a.name = actor_name;

            ALTER TABLE movies
            DROP COLUMN actors, DROP COLUMN genre;
                                             
            ''')

# Create cursor to execute SQL commands

#for command in commands:
cur.execute(commands)

# Commit changes
conn.commit()

# Close communication with server
cur.close()
conn.close()